**creating a dictionary**

In [1]:
data = {"col1":[1, 2, 3,4,'nan',12], "col2":[4, 'nan', 6,'nan',7,'nan'], "col3":[7, 8, 9,'nan','nan',13]}

In [2]:
import pandas as pd
df = pd.DataFrame(data)
selected_columns = df[["col1","col2","col3"]]

In [3]:
df[:5]

  col1 col2 col3
0    1    4    7
1    2  nan    8
2    3    6    9
3    4  nan  nan
4  nan    7  nan

In [4]:
selected_columns[:5]

  col1 col2 col3
0    1    4    7
1    2  nan    8
2    3    6    9
3    4  nan  nan
4  nan    7  nan

**1st method**

In [5]:
selected_columns.loc[selected_columns['col2'] == 'nan', ['col2']] = 23.67

In [6]:
selected_columns

  col1   col2 col3
0    1      4    7
1    2  23.67    8
2    3      6    9
3    4  23.67  nan
4  nan      7  nan
5   12  23.67   13

In [7]:
print(df.iloc[1])

col1      2
col2    nan
col3      8
Name: 1, dtype: object

In [8]:
get=df.iat[1,1]

In [9]:
now=df.iat[0,1]

In [10]:
now

4

In [11]:
get

'nan'

In [12]:
df.head()

  col1 col2 col3
0    1    4    7
1    2  nan    8
2    3    6    9
3    4  nan  nan
4  nan    7  nan

In [13]:
#df['col2']=now

In [14]:
df.loc[(df.col2 == 'nan'), ['col2']] = '23.67'

In [15]:
df.loc[1]

col1        2
col2    23.67
col3        8
Name: 1, dtype: object

In [16]:
df.head()

  col1   col2 col3
0    1      4    7
1    2  23.67    8
2    3      6    9
3    4  23.67  nan
4  nan      7  nan

In [17]:
df.at['3', 'col3'] = 12.78

In [18]:
df

  col1   col2   col3
0    1      4      7
1    2  23.67      8
2    3      6      9
3    4  23.67    nan
4  nan      7    nan
5   12  23.67     13
3  NaN    NaN  12.78

**updating value for a particular cell**

In [19]:
df.iat[4,2] = 2

In [20]:
df

  col1   col2   col3
0    1      4      7
1    2  23.67      8
2    3      6      9
3    4  23.67    nan
4  nan      7      2
5   12  23.67     13
3  NaN    NaN  12.78

**using at**

In [21]:
df.at[4,'col1'] = 4

In [22]:
df

  col1   col2   col3
0    1      4      7
1    2  23.67      8
2    3      6      9
3    4  23.67    nan
4    4      7      2
5   12  23.67     13
3  NaN    NaN  12.78

In [23]:
data_n = {"index":[1,2,3,4,5,6],"col1":[1, 2, 3,4,'nan',12], "col2":[4, 'nan', 6,'nan',7,'nan'], "col3":[7, 8, 9,'nan','nan',13]}

In [25]:
n=pd.DataFrame(data_n)

In [26]:
n

   index col1 col2 col3
0      1    1    4    7
1      2    2  nan    8
2      3    3    6    9
3      4    4  nan  nan
4      5  nan    7  nan
5      6   12  nan   13

**updating the index column using iat**

In [28]:
def preprocessing(df):
  for index in range(0,len(df)): 
      df.iat[index,0] = df.iat[index,0] * 2
  return df

In [29]:
preprocessing(n)

   index col1 col2 col3
0      2    1    4    7
1      4    2  nan    8
2      6    3    6    9
3      8    4  nan  nan
4     10  nan    7  nan
5     12   12  nan   13

**using iloc for updating particular cell value**

In [32]:
n.iloc[[1], [2]] = 26.37

In [33]:
n

   index col1   col2 col3
0      2    1      4    7
1      4    2  26.37    8
2      6    3      6    9
3      8    4    nan  nan
4     10  nan      7  nan
5     12   12    nan   13

**another method to modification in a particular cell**

In [36]:
n.iloc[[0,5], [0]] = [1,2]

In [37]:
n

   index col1   col2 col3
0      1    1      4    7
1      4    2  26.37    8
2      6    3      6    9
3      8    4    nan  nan
4     10  nan      7  nan
5      2   12    nan   13

**Another example with multiple indexing operations**

In [41]:
import numpy as np, pandas as pd

df2 = pd.DataFrame(index=np.arange(3), columns=['x','y','z'])

In [42]:
df2

     x    y    z
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN

In [43]:
df2['x'] = ['A','B','C']

In [44]:
df2

   x    y    z
0  A  NaN  NaN
1  B  NaN  NaN
2  C  NaN  NaN

In [45]:
df2.at[2,'y'] = 400

In [46]:
df2

   x    y    z
0  A  NaN  NaN
1  B  NaN  NaN
2  C  400  NaN

In [47]:
# rows/columns specified does not exist, appends new rows/columns to existing data frame
df2.at['D','w'] = 9000

In [48]:
df2

     x    y    z       w
0    A  NaN  NaN     NaN
1    B  NaN  NaN     NaN
2    C  400  NaN     NaN
D  NaN  NaN  NaN  9000.0

In [50]:
df2.loc['E','q'] = 499

In [51]:
df2

     x    y    z       w      q
0    A  NaN  NaN     NaN    NaN
1    B  NaN  NaN     NaN    NaN
2    C  400  NaN     NaN    NaN
D  NaN  NaN  NaN  9000.0    NaN
E  NaN  NaN  NaN     NaN  499.0

In [52]:
# using df[<some_column_name>] == <condition> to retrieve target rows
df2.at[df2['x']=='B', 'y'] = 10000

In [53]:
df2

     x      y    z       w      q
0    A    NaN  NaN     NaN    NaN
1    B  10000  NaN     NaN    NaN
2    C    400  NaN     NaN    NaN
D  NaN    NaN  NaN  9000.0    NaN
E  NaN    NaN  NaN     NaN  499.0

In [54]:
df2.loc[df2['x']=='B', ['z','w']] = 10000

In [56]:
df2

     x      y      z        w      q
0    A    NaN    NaN      NaN    NaN
1    B  10000  10000  10000.0    NaN
2    C    400    NaN      NaN    NaN
D  NaN    NaN    NaN   9000.0    NaN
E  NaN    NaN    NaN      NaN  499.0

In [57]:
# using a list of index to setup values
df2.iloc[[1,2,4], 2] = 9999

In [58]:
df2

     x      y     z        w      q
0    A    NaN   NaN      NaN    NaN
1    B  10000  9999  10000.0    NaN
2    C    400  9999      NaN    NaN
D  NaN    NaN   NaN   9000.0    NaN
E  NaN    NaN  9999      NaN  499.0

In [59]:
df2.loc[[0,'D','E'],'w'] = 7500

In [60]:
df2

     x      y     z        w      q
0    A    NaN   NaN   7500.0    NaN
1    B  10000  9999  10000.0    NaN
2    C    400  9999      NaN    NaN
D  NaN    NaN   NaN   7500.0    NaN
E  NaN    NaN  9999   7500.0  499.0

In [61]:
df2.at[[0,2,"D"],'x'] = -110

In [62]:
df2

      x      y     z        w      q
0  -110    NaN   NaN   7500.0    NaN
1     B  10000  9999  10000.0    NaN
2  -110    400  9999      NaN    NaN
D  -110    NaN   NaN   7500.0    NaN
E   NaN    NaN  9999   7500.0  499.0

In [63]:
df2.at[:, ['y', 'w']] = 8000

In [64]:
df2

      x     y     z     w      q
0  -110  8000   NaN  8000    NaN
1     B  8000  9999  8000    NaN
2  -110  8000  9999  8000    NaN
D  -110  8000   NaN  8000    NaN
E   NaN  8000  9999  8000  499.0

In [67]:
df2['q'].loc['D':]=10
df2

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

      x     y     z     w     q
0  -110  8000   NaN  8000   NaN
1     B  8000  9999  8000   NaN
2  -110  8000  9999  8000   NaN
D  -110  8000   NaN  8000  10.0
E   NaN  8000  9999  8000  10.0

In [ ]:
import pandas as pd
import numpy as np
import time

NUM_ROWS = 100000
NUM_COLS = 1000
data = np.random.rand(NUM_ROWS,NUM_COLS)
df = pd.DataFrame(data)

NUM_ROWS_NEW = 100
data_tot = np.random.rand(NUM_ROWS + NUM_ROWS_NEW,NUM_COLS)
df_tot = pd.DataFrame(data_tot)

DATA_NEW = np.random.rand(1,NUM_COLS)


#%% FUNCTIONS

# create and append
def create_and_append(df):
    for i in range(NUM_ROWS_NEW):
        df_new = pd.DataFrame(DATA_NEW)
        df = df.append(df_new)
    return df

# create and concatenate
def create_and_concat(df):
    for i in range(NUM_ROWS_NEW):
        df_new = pd.DataFrame(DATA_NEW)
        df = pd.concat((df, df_new))
    return df


# store as dict and 
def store_as_list(df):
    lst = [[] for i in range(NUM_ROWS_NEW)]
    for i in range(NUM_ROWS_NEW):
        for j in range(NUM_COLS):
            lst[i].append(DATA_NEW[0,j])
    df_new = pd.DataFrame(lst)
    df_tot = df.append(df_new)
    return df_tot

# store as dict and 
def store_as_dict(df):
    dct = {}
    for j in range(NUM_COLS):
        dct[j] = []
        for i in range(NUM_ROWS_NEW):
            dct[j].append(DATA_NEW[0,j])
    df_new = pd.DataFrame(dct)
    df_tot = df.append(df_new)
    return df_tot




# preallocate and fill using .at
def fill_using_at(df):
    for i in range(NUM_ROWS_NEW):
        for j in range(NUM_COLS):
            #print("i,j={},{}".format(i,j))
            df.at[NUM_ROWS+i,j] = DATA_NEW[0,j]
    return df


# preallocate and fill using .at
def fill_using_set(df):
    for i in range(NUM_ROWS_NEW):
        for j in range(NUM_COLS):
            #print("i,j={},{}".format(i,j))
            df.set_value(NUM_ROWS+i,j,DATA_NEW[0,j])
    return df


#%% TESTS
t0 = time.time()    
create_and_append(df)
t1 = time.time()
print('Needed {} seconds'.format(t1-t0))

t0 = time.time()    
create_and_concat(df)
t1 = time.time()
print('Needed {} seconds'.format(t1-t0))

t0 = time.time()    
store_as_list(df)
t1 = time.time()
print('Needed {} seconds'.format(t1-t0))

t0 = time.time()    
store_as_dict(df)
t1 = time.time()
print('Needed {} seconds'.format(t1-t0))

t0 = time.time()    
fill_using_at(df_tot)
t1 = time.time()
print('Needed {} seconds'.format(t1-t0))

t0 = time.time()    
fill_using_set(df_tot)
t1 = time.time()
print('Needed {} seconds'.format(t1-t0))
Share

In [69]:
x = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [70]:
x

   A  B
0  1  4
1  2  5
2  3  6

In [71]:
x.iloc[1] = dict(A=10, B=-10)

In [72]:
x

    A   B
0   1   4
1  10 -10
2   3   6